src/VerifyEmployeesStatus.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="VerifyEmployeesStatus" targetNamespace="http://j2ee.netbeans.org/wsdl/esb/src/VerifyEmployeesStatus"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/wsdl/esb/src/VerifyEmployeesStatus" xmlns:ns="http://services/" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/esb/src/VerifyEmployeesStatus">
            <xsd:import namespace="http://services/" schemaLocation="http://localhost:28080/interop-mock/VerifyEmployeesStatus?xsd=1"/>
        </xsd:schema>
    </types>
    <message name="VerifyEmployeesStatusOperationRequest">
        <part name="request" type="ns:verifyEmployeesStatusRequestDto"/>
    </message>
    <message name="VerifyEmployeesStatusOperationResponse">
        <part name="response" type="ns:verifyEmployeesStatusResponseDto"/>
    </message>
    <portType name="VerifyEmployeesStatusPortType">
        <operation name="VerifyEmployeesStatusOperation">
            <input name="input1" message="tns:VerifyEmployeesStatusOperationRequest"/>
            <output name="output1" message="tns:VerifyEmployeesStatusOperationResponse"/>
        </operation>
    </portType>
    <binding name="VerifyEmployeesStatusBinding" type="tns:VerifyEmployeesStatusPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="VerifyEmployeesStatusOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/esb/src/VerifyEmployeesStatus"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/wsdl/esb/src/VerifyEmployeesStatus"/>
            </output>
        </operation>
    </binding>
    <service name="VerifyEmployeesStatusService">
        <port name="VerifyEmployeesStatusPort" binding="tns:VerifyEmployeesStatusBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/VerifyEmployeesStatusService/VerifyEmployeesStatusPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="VerifyEmployeesStatus">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="VerifyEmployeesStatusPortTypeRole" portType="tns:VerifyEmployeesStatusPortType"/>
    </plnk:partnerLinkType>
</definitions>
