CompositeApp1/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ver="http://j2ee.netbeans.org/wsdl/esb/src/VerifyEmployeesStatus">
  <soapenv:Body>
    <ver:VerifyEmployeesStatusOperation>
      <part1>
        <!--Zero or more repetitions:-->
        <employees>?string?</employees>
      </part1>
    </ver:VerifyEmployeesStatusOperation>
  </soapenv:Body>
</soapenv:Envelope>